import base64

from Crypto.Hash import SHA256
from Crypto.Cipher import DES3
from Crypto.Util.Padding import pad, unpad

default_header_bytes = bytes([0xD5, 0x80, 0xD4, 0xB4, 0xD5, 0x84])


def generate_key_from_password(password):
    hash_obj = SHA256.new(password.encode('utf-8'))
    key = hash_obj.digest()[:24]
    return key


def generate_dynamic_headers_data(gorcaruyti_code) -> list:
    arc, arc_hamar, reserve = 0, 7, 0
    return [arc, arc_hamar, gorcaruyti_code, reserve]


def generate_hdm_key(password: str, data: str) -> bytes:
    key = generate_key_from_password(password)
    cipher = DES3.new(key, DES3.MODE_ECB)
    padded_data = pad(data.encode(), DES3.block_size)
    return cipher.encrypt(padded_data)


def unpack_hdm_key(password: str, data: bytes) -> str:
    key = generate_key_from_password(password)
    cipher = DES3.new(key, DES3.MODE_ECB)
    decrypted_data = unpad(cipher.decrypt(data), DES3.block_size)
    return decrypted_data.decode()


def unpack_hdm_response(key, data: bytes) -> str:
    cipher = DES3.new(base64.b64decode(key), DES3.MODE_ECB)
    decrypted_data = unpad(cipher.decrypt(data), DES3.block_size)
    return decrypted_data.decode()


def generate_second_key(key, data: str) -> bytes:
    cipher = DES3.new(base64.b64decode(key), DES3.MODE_ECB)
    padded_data = pad(data.encode(), DES3.block_size)
    return cipher.encrypt(padded_data)


def check_byte_and_add(header, data):
    if isinstance(data, bytes):
        header += data
    elif isinstance(data, int):
        header += data.to_bytes(length=1, byteorder='little')


def added_bytes_to_header(header, data) -> None:
    if isinstance(data, list):
        for byte in data:
            check_byte_and_add(header, byte)
    else:
        check_byte_and_add(header, data)


hdm_error_codes = {
    200: 'Գործողության բարեհաջող ավարտ',
    500: 'ՀԴՄ ներքին սխալ Ընդհանուր տիպի չդասակարգված սխալ',
    400: 'Հարցման սխալ Վերադարձվում է, երբ հարցումը չի վերծանվում',
    402: 'Սխալ արձանագրության տարբերակ',
    403: 'Չարտոնագրված միացում Վերադարձվում է, երբ ՀԴՄ-ում կարագավորված IP հասցեն չի համընկնում կապ հաստատած սարքի IP հասցեի հետ',
    404: 'Սխալ գործողության կոդ Վերադարձվում է, երբ Գլխագրում նշված գործողության կոդը սխալ է',
    101: 'Գաղտնաբառով կոդավորման սխալ',
    102: 'Սեսիայի բանալիով կոդավորման սխալ',
    103: 'Գլխագրի ֆորմատի սխալ',
    104: 'Հարցման հերթական համարի սխալ',
    105: 'JSON ֆորմատավորման սխալ',
    111: 'Օպերատորի գաղտնաբառի սխալ',
    112: 'Այդպիսի օպերատոր գոյություն չունի',
    113: 'Օպերատորը ակտիվ չէ',
    121: 'Սխալ օգտվող',
    141: 'Վերջին կտրոնի գրառումը բացակայում է',
    142: 'Վերջին կտրոնը պատկանում է այլ օգտատիրոջը',
    143: 'Տպիչի ընդհանուր սխալ',
    144: 'Տպիչի ինիցիալիզացիայի սխալ',
    145: 'Տպիչում վերջացել է թուղթը',
    151: 'Այդպիսի բաժին գոյություն չունի',
    152: 'Մուծված գումարը ընդհանուր գումարից պակաս է',
    153: 'Կտրոնի գումարը գերազանցում է սահմանված շեմը',
    154: 'Կտրոնի գումարը պետք է լինի դրական թիվ',
    155: 'Անհրաժեշտ է համաժամանակեցնել ՀԴՄ-ն',
    156: 'Համաժամանակեցումը չհաջողվեց',
    157: 'Սխալ վերադարձի կտրոնի համար',
    158: 'Կտրոնը արդեն վերադարձված է',
    159: 'Ապրանքի գինը եւ քանակը չի կարող լինել ոչ դրական',
    160: 'Զեղչի տոկոսը պետք է լինի ոչ բացասական թիվ եւ լինի 100-ից փոքր',
    161: 'Ապրանքի կոդը սխալ է',
    162: 'Ապրանքի անվանումը սխալ է',
    163: 'Ապրանքի չափման միավորը չի կարող լինել դատարկ',
    164: 'Անկանխիկ վճարման խափանում',
    165: 'Ապրանքի գինը չի կարող լինել 0',
    166: 'Վերջնական գնի հաշվարկի սխալ',
    167: 'Անկանխիկ գումարը ավելի մեծ է, քան կտրոնի ընդհանուր գումարը',
    168: 'Անկանխիկ գումարը ծածկում է ընդհանուր գումարը (Կանխիկ գումարը ավելորդ է)',
    169: 'Ֆիսկալ հաշվետվության ֆիլտրների սխալ ընտրություն (մեկից ավել ֆիլտրի դաշտ է ուղարկվել)',
    170: 'Ֆիսկալ հաշվետվության ժամանակ սխալ ամսաթվային միջակայք է ուղարկվել (միջակայքը չպետք է գերազանցի 2 ամիսը)',
    171: 'Ապրանքի գնի անթույլատրելի արժեք',
    172: 'Կտրոնը՝ ապրանքներով, պարզ կամ կանխավճարի կտրոն չէ',
    173: 'Սխալ զեղչի տեսակ',
    174: 'Վերադարձվող կտրոնը գոյություն չունի',
    175: 'Վերադարձվող կտրոնի սխալ գրանցման համար',
    176: 'Վերջին կտրոնը գոյություն չունի',
    177: 'Նշված տիպի կտրոնների համար վերադարձ հնարավոր չէ կատարել',
    178: 'Հարցված գումարը հնարավոր չէ վերադարձնել',
    179: 'Մասնակի վճարում կտրոնը պետք է վերադարձվի ամբողջությամբ',
    180: 'Ամբողջական վերադարձի ավելի գումար',
    181: 'Վերադարձվող ապրանքի սխալ քանակ',
    182: 'Վերադարձվող կտրոնը իրենից վերադարձ տիպի կտրոն է ներկայացնում',
    183: 'Սխալ ԱԴԳ կոդ',
    184: 'Կանխավճարի վերադարձի անթույլատրելի հարցում',
    185: 'Հնարավոր չէ կատարել տվյալ կտրոնի վերադարձը: Անհրաժեշտ է ՀԴՄ ծրագրի համաժամանակեցում',
    186: 'Կանխավճարի դեպքում սխալ գումար',
    187: 'Կանխավճարի դեպքում սխալ ցուցակ',
    188: 'Սխալ գումարներ',
    189: 'Սխալ կլորացում',
    190: 'Վճարումը հասանելի չէ',
    191: 'Կանխիկի մուտք ելքի ժամանակ գումարը պետք է լինի մեծ 0-ից',
    192: 'ԱՏԳ կոդը պարտադիր է',
    193: 'Գնորդի ՀՎՀՀ-ի ֆորմատը սխալ է',
    194: 'Կանխավճարի դեպքում չպետք է ուղարկվեն emark կոդեր',
    195: 'emark կոդի ֆորմատի սխալ',
    196: 'Այլ երկրի ծածկագիր',
}
